Repository: artificialfintelligence/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/1.3_analog_write.po
Languages: de

source: 1.3 Analog Write
de: 1.3 Analoges Schreiben

source: Overview
de: Überblick

source: You can write the PWM wave to the pin by using analogWrite(). This method can be used to adjust the brightness of LED, change the color of RGB, or adjust the motor speed, etc. Here we will take LED as an example to get gradient brightness of LED.
de: Sie können die PWM-Welle mit analogWrite () auf den Pin schreiben. Diese Methode kann verwendet werden, um die Helligkeit der LED anzupassen, die Farbe von RGB zu ändern oder die Motordrehzahl usw. anzupassen. Hier nehmen wir LED als Beispiel, um die Gradientenhelligkeit der LED zu erhalten.

source: Components Required
de: Erforderliche Komponenten

source: ※ Pulse Width Modulation
de: ※ Pulsweitenmodulation

source: Pulse Width Modulation, or PWM, is a technique for getting analog results with digital means. Digital control is used to create a square wave, a signal switched between on and off. This on-off pattern can simulate voltages in between full on (5 Volts) and off (0 Volts) by changing the portion of the time the signal spends on versus the time that the signal spends off. The duration of "on time" is called the pulse width. To get varying analog values, you change, or modulate, that pulse width. If you repeat this on-off pattem fast enough with an LED for example, the result is as if the signal is a steady voltage between 0 and 5v controlling the brightness of the LED.
de: Die Pulsweitenmodulation PWM ist eine Technik, mit der analoge Ergebnisse mit digitalen Mitteln erzielt werden können. Die digitale Steuerung wird verwendet, um eine Rechteckwelle zu erzeugen, ein Signal, das zwischen Ein und Aus geschaltet wird. Durch Ändern des Verhältnisses von Signaleinschaltzeit zu Signalausschaltzeit kann dieser Schaltmodus die Spannung zwischen vollständig geöffnet (5 Volt) und Aus (0 Volt) simulieren. Die Dauer von "Einschaltzeit" wird als Impulsbreite bezeichnet. Um unterschiedliche Analogwerte zu erhalten, ändern oder modulieren Sie diese Impulsbreite. Wenn Sie dieses Schaltmuster beispielsweise mit einer LED schnell genug wiederholen, ist das Ergebnis so, als ob das Signal eine stabile Spannung zwischen 0 und 5 V ist, die die Helligkeit der LED steuert.

source: A call to analogWrite() is on a scale of 0 - 255, such that analogWrite(255) requests a 100% duty cycle (always on), and analogWrite(127) is a 50% duty cycle (on half the time) for example.
de: Der Bereich für den Aufruf von analogWrite() liegt zwischen 0 und 255. Beispielsweise erfordert analogWrite(255) ein Tastverhältnis von 100% (immer eingeschaltet), während analogWrite(127) ein Tastverhältnis von 50% (halbe Zeite eingeschaltet) ist

source: In this example, we use the PWM pin 9 to drive the LED. Connect one end of the resistor to pin 9. Connect the long pin (anode) of the LED to the other end of the resistor. Connect the short pin (negative, referred to as the cathode) of LED to GND.
de: In diesem Beispiel verwenden wir den PWM-Pin 9, um die LED anzusteuern. Verbinden Sie ein Ende des Widerstands mit Pin 9. Verbinden Sie den langen Pin (Anode) der LED mit dem anderen Ende des Widerstands. Verbinden Sie den kurzen Pin (negativ, als Kathode bezeichnet) der LED mit GND.

source: PWM pins of Mega2560 board are 2 -13, 44 - 46.
de: HINWEIS: Die PWM-Pins der Mega2560-Karte sind 2 - 13, 44 - 46.

source: Schematic Diagram
de: Schematische Darstellung

source: After uploading the code to the Mega2560 board, you can see that the LED gradually brightens out and turns off gradually.
de: Nach dem Hochladen des Codes auf die Mega2560-Karte können Sie sehen, dass die LED allmählich aufhellt und sich allmählich erlischt.

source: Code Analysis
de: Code-Analyse

source: Declare pin 9 as ledPin.
de: Deklarieren Sie Pin 9 als LEDPin.

source: analogWrite() in loop() assigns ledPin an analog value (PWM wave) between 0 and 255 to change the brightness of LED.
de: analogWrite () in loop () weist ledPin einen analogen Wert (PWM-Welle) zwischen 0 und 255 zu, um die Helligkeit der LED zu ändern.

source: Using a for loop, the value of analogWrite() can be changed step by step between the minimum value (0) and the maximum value (255).
de: Mit einer for-Schleife kann der Wert von analogWrite () schrittweise zwischen dem Minimalwert (0) und dem Maximalwert (255) geändert werden.

source: In order to see the experimental phenomenon clearly, a delay(30) needs to be added to the for cycle to control the brightness change time.
de: Um das experimentelle Phänomen klar zu sehen, muss dem for-Zyklus eine Verzögerung (30) hinzugefügt werden, um die Helligkeitsänderungszeit zu steuern.

source: Phenomenon Picture
de: Phänomen Bild
