Repository: artificialfintelligence/sunfounder_vincent_kit_for_arduino
Catalog: docs/source/locale/*/LC_MESSAGES/2.11_passive_buzzer.po
Languages: de

source: 2.11 Passive Buzzer
de: 2.11 Passiver Summer

source: Overview
de: Überblick

source: In this lesson, you will get to know about passive buzzer. As a type of electronic buzzer with an integrated structure, passive buzzer is supplied by DC power, widely used in computer, alarm, electronic toy, telephone, timer and other electronic products or voice devices.
de: In dieser Lektion lernen Sie den passiven Summer kennen. Passiver Summer ist ein elektronischer Summer mit integrierter Struktur, der von einer Gleichstromquelle gespeist wird und in Computern, Alarmen, elektronischem Spielzeug, Telefonen, Zeitschaltuhren und anderen elektronischen Produkten oder Sprachgeräten weit verbreitet ist.

source: Components Required
de: Erforderliche Komponenten

source: Component Introduction
de: Komponenteneinführung

source: Buzzers can be categorized as active and passive ones (see the following picture). Turn the buzzer so that its pins are facing up, and the buzzer with a green circuit board is a passive buzzer, while the one enclosed with a black tape is an active one.
de: Summer können in aktive und passive unterteilt werden (siehe folgendes Bild). Drehen Sie den Summer so, dass seine Nadel nach oben zeigt, der Summer mit der grünen Leiterplatte ist ein passiver Summer und der mit schwarzem Klebeband umwickelte Summer ist ein aktiver Summer.

source: The difference between an active buzzer and a passive buzzer:
de: Der Unterschied zwischen einem aktiven und einem passiven Summer:

source: The difference between an active buzzer and a passive buzzer is: An active buzzer has a built-in oscillating source, so it will make sounds when electronic. But a passive buzzer does not have such source, so it will not beep if DC signals are used; instead, you need to use square waves whose frequency is between 2K and 5K to drive it. The active buzzer is often more expensive than the passive one because of multiple built-in oscillating circuits.
de: Der Unterschied zwischen einem aktiven und einem passiven Summer besteht darin, dass ein aktiver Summer über eine eingebaute Oszillationsquelle verfügt, sodass er bei Elektrifizierung Geräusche erzeugt. Ein passiver Summer verfügt jedoch nicht über eine solche Quelle, sodass bei Verwendung von Gleichstromsignalen kein Piepton ertönt. Stattdessen müssen Sie Rechteckwellen verwenden, deren Frequenz zwischen 2K und 5K liegt, um sie anzutreiben. Der aktive Summer ist aufgrund mehrerer eingebauter Schwingkreise oft teurer als der passive.

source: The following is the electrical symbol of a buzzer. It has two pins with positive and negative poles. With a + in the surface represents the anode and the other is the cathode.
de: Das Folgende ist das elektrische Symbol eines Summers. Es hat zwei Stifte mit positiven und negativen Polen. Mit einem + in der Oberfläche steht die Anode und das andere ist die Kathode.

source: You can check the pins of the buzzer, the longer one is the anode and the shorter one is the cathode. Please don't mix them up when connecting, otherwise the buzzer will not make sound.
de: Sie können die Stifte des Summers überprüfen, je länger die Anode und je kürzer die Kathode ist. Bitte verwechseln Sie sie beim Anschließen nicht, da sonst kein Summer ertönt.

source: In this example, what we use to drive the buzzer is the pin 9. We get the cathode of the Buzzer to GND, and the anode to the digital pin 9.
de: In diesem Beispiel verwenden wir den Pin 9, um den Summer anzutreiben. Wir bringen die Kathode des Summers auf GND und die Anode auf den digitalen Pin 9.

source: Schematic Diagram
de: Schematische Darstellung

source: At the time when you finish uploading the codes to the Mega2560 board, you can hear a melody containing seven notes.
de: Wenn Sie mit dem Hochladen der Codes auf das Mega2560-Board fertig sind, hören Sie eine Melodie mit sieben Noten.

source: Code Analysis
de: Code-Analyse

source: There are two points needing your attention:
de: Es gibt zwei Punkte, die Ihre Aufmerksamkeit erfordern:

source: ①tone() & noTone(): This function is used to control the sound of the passive buzzer directly and its prototype is as follows:
de: ① Ton () & noTone (): Mit dieser Funktion wird der Klang des passiven Summers direkt gesteuert. Der Prototyp lautet wie folgt:

source: Generates a square wave of the specified frequency (and 50% duty cycle) on a pin (so as to make the passive buzzer vibrate to make sound). A duration can be specified, otherwise the wave continues until a call to noTone(). The pin can be connected to a piezo buzzer or other speaker to play tones.
de: Erzeugt eine Rechteckwelle mit der angegebenen Frequenz (und einem Tastverhältnis von 50%) an einem Pin (damit der passive Summer vibriert und Geräusche erzeugt). Eine Dauer kann angegeben werden, andernfalls wird die Welle bis zu einem Aufruf von noTone () fortgesetzt. Der Pin kann an einen Piezo-Summer oder einen anderen Lautsprecher angeschlossen werden, um Töne abzuspielen.

source: Only one tone can be generated at a time. If a tone is already playing on a different pin, the call to tone() will have no effect. If the tone is playing on the same pin, the call will set its frequency.
de: Es kann jeweils nur ein Ton erzeugt werden. Wenn ein Ton bereits auf einem anderen Pin abgespielt wird, hat der Aufruf von Ton () keine Auswirkung. Wenn der Ton auf demselben Pin abgespielt wird, stellt der Anruf seine Frequenz ein.

source: Use of the tone() function will interfere with PWM output on pins 3 and 11 (on boards other than the Mega).
de: Die Verwendung der Funktion ton () stört die PWM-Ausgabe an den Pins 3 und 11 (auf anderen Karten als der Mega).

source: It is not possible to generate tones lower than 31Hz.
de: Es ist nicht möglich, Töne unter 31 Hz zu erzeugen.

source: **pin**: The Arduino pin on which to generate the tone.
de: **Pin**: Der Arduino-Pin, auf dem der Ton erzeugt werden soll.

source: **frequency**: The frequency of the tone in hertz.
de: **Frequenz**: Die Frequenz des Tons in Hertz.

source: **duration**: The duration of the tone in milliseconds (optional)
de: **Dauer**: Die Dauer des Tons in Millisekunden (optional)

source: Stops the generation of a square wave triggered by tone(). Has no effect if no tone is being generated.
de: Stoppt die Erzeugung einer durch Ton () ausgelösten Rechteckwelle. Hat keine Auswirkung, wenn kein Ton erzeugt wird.

source: Having known the two functions, you may grasp the codes—the installation of the array melody[] and the array noteDurations[] is the preparation of the subsequently several times of calling of the function tone() and the changing of tone and duration in the loop for better effect of music play.
de: Nachdem Sie diese beiden Funktionen kennen, können Sie den Code beherrschen: Die Installation der Array-Melodie [] und des Arrays noteDurations [] ist die Vorbereitung für die nachfolgenden Aufrufe des Funktion Tons () und die Vorbereitung für die Änderung von Ton und Dauer. Loop-Wiedergabe für einen besseren Musikwiedergabeeffekt.

source: ②pitches.h: The code uses an extra file, **pitches.h**. This file contains all the pitch values for typical notes. For example, NOTE_C4 is middle C. NOTE_FS4 is F sharp, and so forth. This note table was originally written by Brett Hagman, on whose work the tone() command was based. You may find it useful whenever you want to make musical notes.
de: ② Pitches.h: Der Code verwendet eine zusätzliche Datei, **Pitches.h**. Diese Datei enthält alle Tonhöhenwerte für typische Noten. Zum Beispiel ist NOTE_C4 Mitte C. NOTE_FS4 ist Fis und so weiter. Diese Notentabelle wurde ursprünglich von Brett Hagman geschrieben, auf dessen Arbeit der Befehl ton () basierte. Sie können es nützlich finden, wenn Sie Noten machen möchten.

source: There is already a pitches.h file in this sample program. If we put it together with the main code in one folder, the successive steps of installing pitches.h can be omitted.
de: In diesem Beispielprogramm befindet sich bereits eine Datei Pitches.h. Wenn wir es mit dem Hauptcode in einem Ordner zusammenfassen, können die aufeinander folgenden Schritte zum Installieren von Pitches.h weggelassen werden.

source: After you open the code 2.11passiveBuzzer, if you cannot open the pitches.h code, you can just install one manually. The steps are as follows:
de: Wenn Sie nach dem Öffnen des Codes 2.11passiveBuzzer den Code Pitch.h nicht öffnen können, können Sie ihn einfach manuell installieren. Die Schritte sind wie folgt:

source: To make the pitches.h file, either click on the button just below the serial monitor icon and choose "New Tab", or use Ctrl+Shift+N.
de: Um die Datei pitches.h zu erstellen, klicken Sie entweder auf die Schaltfläche direkt unter dem Symbol für den seriellen Monitor und wählen Sie "Neue Registerkarte" oder verwenden Sie Strg + Umschalt + N.

source: Then paste in the following code and save it as **pitches.h**:
de: Fügen Sie dann den folgenden Code ein und speichern Sie ihn als **Pitch.h**:

source: Phenomenon Picture
de: Phänomen Bild
